# Depth Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
HostObjectSubcomponentInfo..::..Depth Property
HostObjectSubcomponentInfo Class See Also
---
The depth of the roof or floor slab.
**Namespace:** Autodesk.Revit.DB.IFC**Assembly:** RevitAPIIFC (in RevitAPIIFC.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2016
# Syntax
C#
---
```text
public double Depth { get; }
```

Visual Basic
---
```text
Public ReadOnly Property Depth As Double
	Get
```

Visual C++
---
```text
public:
property double Depth {
	double get ();
}
```

# Remarks
The depth is the thickness of the slab as measured perpendicular to the slab's main faces, as opposed to the vertical extrusion distance.
# See Also
HostObjectSubcomponentInfo Class
Autodesk.Revit.DB.IFC Namespace